org/articles/anki.org
* Notes on Spaced Repetition

#+BEGIN_QUOTE
Draft: v1.0 | Posted: 6/8/2018 | Updated: 6/8/2018 | confidence of success: 85% | estimated time to completion: 3/5/2018 | importance: Medium
#+END_QUOTE

** What is Spaced Repetition?

Spaced Reptition is a method of efficiently reviewing flashcards by scheduling them based upon how easily you remember something. The gist of the idea is that it's much easier to remember something in your long-term memory than your short-term memory, so if you are trying to memorize a large body of information you should prioritize things you don't know very well and things you are just about to forget. Below is a good video explaining the concept and the relevant research behind it.

#+BEGIN_HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/ai2K3qHpC7c" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
#+END_HTML

The cool thing about spaced repetition is that it allows you to review and manage an extremely large body of information with relatively little daily review[fn:5]. I use [[https://apps.ankiweb.net/][Anki]] to review flashcards, but other people use [[https://mnemosyne-proj.org/][Mnemosyne]] which works just as well. I use this little application a lot to remember pretty much anything I think is worth remembering, so I figured it would be useful to write up some of my notes from using it.

** Spaced Repetition as a Deep Reading Tool
  
I am a chronic skimmer - I often read books very quickly, consume a lot of books in a short window, and then forget everything in them after a short while. My first solution to this was very [[https://www.goodreads.com/user/show/25277520-eryk-banatt][detailed reviews on goodreads]]. It didn't help me much in committing my reading to memory, but at least I was able to go back and reread my notes as a refresher whenever I needed to. I find that I have relatively weak retention when I read, and have always been slanted towards [[https://en.wikipedia.org/wiki/Fluid_and_crystallized_intelligence#Improving_fluid_intelligence_with_training_on_working_memory][fluid intelligence, rather than crystallized intelligence]]. Spaced repetition (more specifically, the use of a single, uncategorized deck separated by tags rather than decks) was a gamechanger for me in this respect - I started reading things with my phone open next to me (I shelled out the money for Anki's [now free, but at the time] ridiculously overpriced app, I use it a lot so I felt the cost-per-use was rather low), and making a short flashcard for any detail or quote I felt like I wanted to remember. This, in turn, let me do three things:
  
A: It allowed me to absorb as much as I wanted from my reading, down to the level of direct quotes

B: It allowed me to realistically understand how much I could read in a day / a single sitting

C: It allowed me to [[http://cgi.stanford.edu/~dept-ctl/tomprof/posting.php?ID%3D928][better engage]] with the material I was reading, since I'd actually grasp details instead of just the concepts
  
The second point is very important, because it's one that I struggled with a great deal for a very long time. I'd often sit down with a theory-dense book and just start reading it, as if it was a novel, more or less straight through. I'd inevitably find myself not really grasping things, and it'd eventually become a huge pain to read it. Making flashcards of important details in a book as I went allowed me to roughly see how much information I was actually absorbing, via my daily reviews. Somehow I was surprised to realize that my absorption rate for more difficult books was worse, and that I ought to be reading those slower (for example, a chapter of Tae Kim's Guide to Japanese Grammar wasn't so bad, but a chapter of Introductory Statistics with R was very difficult and those cards frequently gave me a hard time). This ended up being a reasonably useful tool I could use to adjust my studying habits - if I was going through a book and it felt too easy, I could try studying more each day; if I felt like it was hard, I could go slower and give myself more time to think about the ideas.
  
The third point was pretty useful because actively reading almost anything while actively stopping to make flashcards makes it rather difficult to zone out while reading, which is a bad habit I had for a long time. I'd read a page, look back up, and realize that I was so distracted that I didn't really understand the literal last page I had just read. Actively making flashcards as I read made it so that I had to actually be reading when I was reading, which did wonders for keeping me on-task during study time.
  
