articles/anki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>anki</title>
<!-- 2018-07-08 Sun 17:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ambi" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default.css" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content">
<h1 class="title">anki</h1>
<div id="table-of-contents">
<h1>Table of Contents</h1>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Notes on Spaced Repetition</a>
<ul>
<li><a href="#sec-1-1">What is Spaced Repetition?</a></li>
<li><a href="#sec-1-2">Spaced Repetition as a Deep Reading Tool</a></li>
<li><a href="#sec-1-3">Spaced Repetition as Removal of "XP Waste"</a></li>
<li><a href="#sec-1-4">Quizbowl as a Content Aggregator</a></li>
<li><a href="#sec-1-5">Useful Habits for Using Spaced Repetition</a></li>
<li><a href="#sec-1-6">Closing</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-1">
<h1 id="sec-1">Notes on Spaced Repetition</h1>
<div class="outline-text-1" id="text-1">
<blockquote>
<p>
Draft: v1.0 | Posted: 6/8/2018 | Updated: 6/8/2018 | confidence of success: 85% | estimated time to completion: 3/5/2018 | importance: Medium
</p>
</blockquote>
</div>

<div id="outline-container-sec-1-1" class="outline-2">
<h2 id="sec-1-1">What is Spaced Repetition?</h2>
<div class="outline-text-2" id="text-1-1">
<p>
Spaced Reptition is a method of efficiently reviewing flashcards by scheduling them based upon how easily you remember something. The gist of the idea is that it's much easier to remember something in your long-term memory than your short-term memory, so if you are trying to memorize a large body of information you should prioritize things you don't know very well and things you are just about to forget. Below is a good video explaining the concept and the relevant research behind it.
</p>

<iframe width="560" height="315" src="https://www.youtube.com/embed/ai2K3qHpC7c" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>

<p>
The cool thing about spaced repetition is that it allows you to review and manage an extremely large body of information with relatively little daily review<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. I use <a href="https://apps.ankiweb.net/">Anki</a> to review flashcards, but other people use <a href="https://mnemosyne-proj.org/">Mnemosyne</a> which works just as well. I use this little application a lot to remember pretty much anything I think is worth remembering, so I figured it would be useful to write up some of my notes from using it.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-2">
<h2 id="sec-1-2">Spaced Repetition as a Deep Reading Tool</h2>
<div class="outline-text-2" id="text-1-2">
<p>
I am a chronic skimmer - I often read books very quickly, consume a lot of books in a short window, and then forget everything in them after a short while. My first solution to this was very <a href="https://www.goodreads.com/user/show/25277520-eryk-banatt">detailed reviews on goodreads</a>. It didn't help me much in committing my reading to memory, but at least I was able to go back and reread my notes as a refresher whenever I needed to. I find that I have relatively weak retention when I read, and have always been slanted towards <a href="https://en.wikipedia.org/wiki/Fluid_and_crystallized_intelligence#Improving_fluid_intelligence_with_training_on_working_memory">fluid intelligence, rather than crystallized intelligence</a>. Spaced repetition (more specifically, the use of a single, uncategorized deck separated by tags rather than decks) was a gamechanger for me in this respect - I started reading things with my phone open next to me (I shelled out the money for Anki's [now free, but at the time] ridiculously overpriced app, I use it a lot so I felt the cost-per-use was rather low), and making a short flashcard for any detail or quote I felt like I wanted to remember. This, in turn, let me do three things:
</p>

<p>
A: It allowed me to absorb as much as I wanted from my reading, down to the level of direct quotes
</p>

<p>
B: It allowed me to realistically understand how much I could read in a day / a single sitting
</p>

<p>
C: It allowed me to <a href="http://cgi.stanford.edu/~dept-ctl/tomprof/posting.php?ID=928">better engage</a> with the material I was reading, since I'd actually grasp details instead of just the concepts
</p>

<p>
The second point is very important, because it's one that I struggled with a great deal for a very long time. I'd often sit down with a theory-dense book and just start reading it, as if it was a novel, more or less straight through. I'd inevitably find myself not really grasping things, and it'd eventually become a huge pain to read it. Making flashcards of important details in a book as I went allowed me to roughly see how much information I was actually absorbing, via my daily reviews. Somehow I was surprised to realize that my absorption rate for more difficult books was worse, and that I ought to be reading those slower (for example, a chapter of Tae Kim's Guide to Japanese Grammar wasn't so bad, but a chapter of Introductory Statistics with R was very difficult and those cards frequently gave me a hard time). This ended up being a reasonably useful tool I could use to adjust my studying habits - if I was going through a book and it felt too easy, I could try studying more each day; if I felt like it was hard, I could go slower and give myself more time to think about the ideas.
</p>

<p>
The third point was pretty useful because actively reading almost anything while actively stopping to make flashcards makes it rather difficult to zone out while reading, which is a bad habit I had for a long time. I'd read a page, look back up, and realize that I was so distracted that I didn't really understand the literal last page I had just read. Actively making flashcards as I read made it so that I had to actually be reading when I was reading, which did wonders for keeping me on-task during study time.
</p>
</div>
</div>
