org/articles/anki.org
** Spaced Repetition as Removal of "XP Waste"
  
[[http://runescape.wikia.com/wiki/Old_School_RuneScape][Old School Runescape]] Players have a wonderful concept that they refer to as "XP waste". Playing Runescape is mostly about maximizing your experienced gained per unit time (the game doesn't exactly involve much else), so players will often calculate how much experience they ought to gain performing a certain task (e.g. "if you cut this type of tree for an hour, you should gain 10,000 experience per hour"). However, there are many reasons why you might not actually hit that amount of experience in one hour - trips to the in-game bank, going to the bathroom in real life, deciding to take a nap, getting bored, etc. Therefore, the difference between experience gained and theoretical experience possible is referred to as "XP waste" (i.e. "you could have earned this much more experience but you wasted your time and lost out on it"). Granted, people have differing levels of commitment to eliminating XP waste (e.g using better training spots vs optimizing for global timer vs not sleeping), but the overall idea I think is pretty interesting.
  
The nice thing, I find, about spaced repetition, is the low effective time cost to actually doing it. Even studying a good amount each day (50+ new cards, plus reviews) will only swell your review time up to ~45 minutes per day, and that sounds much worse than it actually is, compared to something like Exercise or Meditation. Doing 45 minutes of exercise feels like a good chunk of time, since it needs to be a solid 45 minute block of your day in order to be useful. But Anki can be done at any time, for any amount of time. Waiting for your eggs to cook? Do a few flashcards. Walking to class? Do a few flashcards. On the bus home after work? Do a few flashcards. You can't exercise in 8 randomly spaced 150 second chunks throughout the day, but you *can* do flashcards like that. Spaced repetition requires some time, but it can come from any time in your day, *including dead time*. This is time you normally would have spent doing literally nothing, and it ends up making "XP waste" moments in your life into ones that actually have a purpose. **Doing flashcards is just free experience**, and making your default nervous phone habit "open Anki" instead of "open twitter" will essentially make this a zero-impact habit on your day-to-day routine.
  
** Quizbowl as a Content Aggregator
  
Something I think is fun and heavily applicable to spaced repetition is [[https://www.qbwiki.com/wiki/Quizbowl][Quizbowl]], or more broadly "trivia"[fn:1]
  
I was "decent" at quizbowl in high school, where my [[https://en.wikipedia.org/wiki/Sussex_County,_New_Jersey][geographic location]] played a large part of the lack of serious competition, but after being admitted to Yale (at the time arguably [[https://www.qbwiki.com/wiki/2012_ACF_Nationals][the best]]/second best collegiate team, period, with [[https://en.wikipedia.org/wiki/Matt_Jackson_(Jeopardy!_contestant)][Matt Jackson]] spearheading the team) I played in a few collegiate novice tournaments my freshman year of college, found out I [[http://www.hsquizbowl.org/db/tournaments/1652/stats/prelims/teamdetail/#t27%20][was]] [[http://www.hsquizbowl.org/db/tournaments/1600/stats/complete/teamdetail/#t0][terrible]], and promptly quit the team to pursue competitive Super Smash Brothers Melee instead.
  
Fast forwards to my realization that it is possible to remember things you read for more than a week after you read them, and suddenly I felt extremely motivated to hit up [[http://quizbowlpackets.com/][quizbowlpackets.com]]. The nice thing about spaced repetition is that you can memorize tons of things, but the weird thing about it is that the question "what do you want to memorize?" is surprisingly hard to answer. [[http://rs.io/anki-tips/][Robb Seaton]] puts it well: 

#+BEGIN_QUOTE
"Or here’s a common hangup people have, and that I had, when starting with spaced repetition. It’s the question, 'What ought I memorize?' and people think, well, maybe the presidents or something, because that’s what they’ve associated memorization with. It’s the wrong question. Ask 'What’s interesting?' and start ankifying that." [fn:2]
#+END_QUOTE

What's really exciting about quizbowl is that it's quite literally structured to provide you with useful information. You're rewarded on a question-by-question basis for [[https://www.qbwiki.com/wiki/Pyramidality][knowing more obscure things about a topic]], and you're rewarded on a round-by-round basis by [[https://www.qbwiki.com/wiki/Generalist][knowing more answers than your opponent]]. I'm not eligible for collegiate tournaments and I'm not skilled enough to solo open tournaments, so you might ask "why care about quizbowl?" The answer here lies in utilizing quizbowl packets as *cool shit aggregators*. By its nature, a good quizbowl question contains a range of clues about a topic, and if you don't know about something then a quizbowl question can serve as a unit of 3-6 things about it (quizbowl players typically advocate reading packets as a method of improving at the game). Knowing about random things, even on a somewhat shallow level, often leads me to some of my [[http://planetbanatt.net/articles/pingpongzen.html][most interesting projects]], which in turn makes my knowledge of those things less shallow. Viewing it from this lens, playing quizbowl is like reading a manic RSS feed of snippets cut out of textbooks, lowering the chance that you spend lots of time on something boring, and making it easy to find new things worth reading about. And its pretty fun![fn:3]
  
