articles/anki.html

<div id="outline-container-sec-1-3" class="outline-2">
<h2 id="sec-1-3">Spaced Repetition as Removal of "XP Waste"</h2>
<div class="outline-text-2" id="text-1-3">
<p>
<a href="http://runescape.wikia.com/wiki/Old_School_RuneScape">Old School Runescape</a> Players have a wonderful concept that they refer to as "XP waste". Playing Runescape is mostly about maximizing your experienced gained per unit time (the game doesn't exactly involve much else), so players will often calculate how much experience they ought to gain performing a certain task (e.g. "if you cut this type of tree for an hour, you should gain 10,000 experience per hour"). However, there are many reasons why you might not actually hit that amount of experience in one hour - trips to the in-game bank, going to the bathroom in real life, deciding to take a nap, getting bored, etc. Therefore, the difference between experience gained and theoretical experience possible is referred to as "XP waste" (i.e. "you could have earned this much more experience but you wasted your time and lost out on it"). Granted, people have differing levels of commitment to eliminating XP waste (e.g using better training spots vs optimizing for global timer vs not sleeping), but the overall idea I think is pretty interesting.
</p>

<p>
The nice thing, I find, about spaced repetition, is the low effective time cost to actually doing it. Even studying a good amount each day (50+ new cards, plus reviews) will only swell your review time up to ~45 minutes per day, and that sounds much worse than it actually is, compared to something like Exercise or Meditation. Doing 45 minutes of exercise feels like a good chunk of time, since it needs to be a solid 45 minute block of your day in order to be useful. But Anki can be done at any time, for any amount of time. Waiting for your eggs to cook? Do a few flashcards. Walking to class? Do a few flashcards. On the bus home after work? Do a few flashcards. You can't exercise in 8 randomly spaced 150 second chunks throughout the day, but you <b>can</b> do flashcards like that. Spaced repetition requires some time, but it can come from any time in your day, <b>including dead time</b>. This is time you normally would have spent doing literally nothing, and it ends up making "XP waste" moments in your life into ones that actually have a purpose. <b><b>Doing flashcards is just free experience</b></b>, and making your default nervous phone habit "open Anki" instead of "open twitter" will essentially make this a zero-impact habit on your day-to-day routine.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-2">
<h2 id="sec-1-4">Quizbowl as a Content Aggregator</h2>
<div class="outline-text-2" id="text-1-4">
<p>
Something I think is fun and heavily applicable to spaced repetition is <a href="https://www.qbwiki.com/wiki/Quizbowl">Quizbowl</a>, or more broadly "trivia"<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>

<p>
I was "decent" at quizbowl in high school, where my <a href="https://en.wikipedia.org/wiki/Sussex_County,_New_Jersey">geographic location</a> played a large part of the lack of serious competition, but after being admitted to Yale (at the time arguably <a href="https://www.qbwiki.com/wiki/2012_ACF_Nationals">the best</a>/second best collegiate team, period, with <a href="https://en.wikipedia.org/wiki/Matt_Jackson_(Jeopardy!_contestant)">Matt Jackson</a> spearheading the team) I played in a few collegiate novice tournaments my freshman year of college, found out I <a href="http://www.hsquizbowl.org/db/tournaments/1652/stats/prelims/teamdetail/#t27%20">was</a> <a href="http://www.hsquizbowl.org/db/tournaments/1600/stats/complete/teamdetail/#t0">terrible</a>, and promptly quit the team to pursue competitive Super Smash Brothers Melee instead.
</p>

<p>
Fast forwards to my realization that it is possible to remember things you read for more than a week after you read them, and suddenly I felt extremely motivated to hit up <a href="http://quizbowlpackets.com/">quizbowlpackets.com</a>. The nice thing about spaced repetition is that you can memorize tons of things, but the weird thing about it is that the question "what do you want to memorize?" is surprisingly hard to answer. <a href="http://rs.io/anki-tips/">Robb Seaton</a> puts it well: 
</p>

<blockquote>
<p>
"Or here’s a common hangup people have, and that I had, when starting with spaced repetition. It’s the question, 'What ought I memorize?' and people think, well, maybe the presidents or something, because that’s what they’ve associated memorization with. It’s the wrong question. Ask 'What’s interesting?' and start ankifying that." <sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>
</blockquote>

<p>
What's really exciting about quizbowl is that it's quite literally structured to provide you with useful information. You're rewarded on a question-by-question basis for <a href="https://www.qbwiki.com/wiki/Pyramidality">knowing more obscure things about a topic</a>, and you're rewarded on a round-by-round basis by <a href="https://www.qbwiki.com/wiki/Generalist">knowing more answers than your opponent</a>. I'm not eligible for collegiate tournaments and I'm not skilled enough to solo open tournaments, so you might ask "why care about quizbowl?" The answer here lies in utilizing quizbowl packets as <b>cool shit aggregators</b>. By its nature, a good quizbowl question contains a range of clues about a topic, and if you don't know about something then a quizbowl question can serve as a unit of 3-6 things about it (quizbowl players typically advocate reading packets as a method of improving at the game). Knowing about random things, even on a somewhat shallow level, often leads me to some of my <a href="http://planetbanatt.net/articles/pingpongzen.html">most interesting projects</a>, which in turn makes my knowledge of those things less shallow. Viewing it from this lens, playing quizbowl is like reading a manic RSS feed of snippets cut out of textbooks, lowering the chance that you spend lots of time on something boring, and making it easy to find new things worth reading about. And its pretty fun!<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>
</p>
</div>
</div>
