articles/anki.html

<div id="outline-container-sec-1-5" class="outline-2">
<h2 id="sec-1-5">Useful Habits for Using Spaced Repetition</h2>
<div class="outline-text-2" id="text-1-5">
<ul class="org-ul">
<li>Every time you look something reasonably useful up (e.g. "wait, what does this word mean?" Or "didn't they do a study on football causing CTE?") make a flashcard about it (usually takes 20 seconds)<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>
</li>
<li>Use one big deck, and separate things by tags instead. It's much better to do it this way since otherwise reviews will pile on in decks you have no motivation for, and putting everything together is a good way to avoid the pain of starting. Likewise, it's more fun this way! One moment you'll be reading a sentence in Japanese and the next you'll be thinking about frame data in super smash brothers; it keeps you on your toes!
</li>
<li>Associate feeling of being bored and waiting for something with the act of doing flashcards 
</li>
<li>Have phone open while reading nonfiction and make flashcards for things that seem interesting but also not trivial to remember
</li>
<li>Make flashcards as short as possible - longer answer flashcards are prone to being bad flashcards and typically end up leeches / deleted
</li>
<li>Use images often, and make drawings when applicable - they can be terrible ms paint drawings, if you don't plan on sharing them then nobody will judge you for your art and it will help you remember.
</li>
<li>Don't add things you don't care about, or you will not want to actually do your reviews. I have made it a point to delete anything I come across during reviews that I decide is a badly made card or a card on something I don't care about.
</li>
<li>I have noticed when I am doing flashcards sleep deprived that I sometimes glaze over a card and do not really absorb the meaning of certain questions, but think something like "oh it's this card, and the answer to this card is Krebs Cycle". I think this points to good flashcard-making habits making cards as hard to differentiate as possible, which usually involves making them as short as possible to avoid unique strings giving the answer away to you (if the only card in your deck with the phrase "million years ago" is "Cambrian Explosion", you might not actually remember the "541" part when you actually need to remember the Cambrian Explosion for some reason)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-2">
<h2 id="sec-1-6">Closing</h2>
<div class="outline-text-2" id="text-1-6">
<p>
I plan to periodically add to this page as I come up with useful thoughts on flashcarding, but overall I think that using flashcards is one of those "Real-Life Cheat Codes" that I wish I found out earlier. It's one of those things like Counting Calories or Index Funds that is actually capable of producing <a href="https://en.wikipedia.org/wiki/Pareto_principle">large changes with minimal effort</a>, and I think things like that deserve some good documentation even if it isn't entirely complete.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Further reading <a href="http://www.gwern.net/Spaced-repetition">http://www.gwern.net/Spaced-repetition</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
this word is sort of frowned upon in quizbowl circles, since quizbowl tries to put a strong emphasis on, for lack of a better term, "useful academic knowledge", rather than "arbitrary memorized facts". "Trivia" typically refers to information that offers no reason why anybody would know it (e.g. "Nikola Tesla was born on July 10, 1856"), whereas pop culture questions are affectionately referred to as "<a href="https://www.qbwiki.com/wiki/Trash">Trash</a>"; and typically get regaled to side tournaments or the odd 1-2 questions per game. <a href="https://www.qbwiki.com/wiki/Trivia">Further reading</a>.
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
Robb Seaton uses anki for, as far as I can tell, literally everything - he puts little factoids about people he likes in his deck, so that he can memorize stuff like "My coworker's favorite color" or "someone's favorite type of cheese" which strikes me as a little much, but knowing people's birthdays certainly seems like a great example of a nontraditional use of anki.
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
for more information see <a href="https://myanimelist.net/manga/23165/Nana_Maru_San_Batsu">Nana Maru San Batsu</a>
</p></div>

<div class="footdef"><sup><a id="fn.5" name="fn.5" class="footnum" href="#fnr.5">5</a></sup> <p class="footpara">
my rule of thumb is thinking of gwern's estimation of a card roughly equaling 5 minutes of time and thinking "am I willing to stare at this for five minutes if it means memorizing it"
</p>

<p class="footpara">
On top of that, since I always have emacs open these days I have a (very very basic) capture template that creates an anki card which makes the process pretty straightforward - no matter what I'm looking at I can do Win-3 C-c c a and be in the process of making a card.
</p>

<pre class="example">
("a" "anki basic" entry (file+headline "~/Dropbox/org/logs/added_anki.org" "Basic")
     "* know :deck: \n** Item :note: \n\t:PROPERTIES:\n\t:ANKI_NOTE_TYPE: Basic\n\t:ANKI_TAGS: \n\t:END:\n*** Front\n%?\n*** Back\n")
</pre></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
<div id="comments">
    <p></p>
    <hr />
       <div id="disqus_thread">
           <script>
(function() {
var d = document, s = d.createElement('script');
s.src = 'https://planetbanatt.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</body>
</html>
